kodezine/STM32H743I-EVAL2/demo/__startup/__vectors.c
#include <stdint.h>
#include "stm32h743xx.h"
#if defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6100100)
    #include "__vectors_ac6.h"
#elif defined(__GNUC__)
    #if defined(__clang__)
        #include "__vectors_llvm.h"
    #else
        //#include "__vectors_gcc.h"
    #endif
#endif
#include "system_ARMCM7.h"
#include "cmsis_compiler.h"

/******************************************************************************
 * @file     startup_<Device>.c
 * @brief    CMSIS-Core(M) Device Startup File for
 *           Device <Device>
 * @version  V1.0.0
 * @date     20. January 2021
 ******************************************************************************/
/*
 * Copyright (c) 2009-2021 Arm Limited. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

/*---------------------------------------------------------------------------
  External References
 *---------------------------------------------------------------------------*/
extern uint32_t __INITIAL_SP;
extern uint32_t __STACK_LIMIT;

#if defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
extern uint32_t __STACK_SEAL;
#endif

extern __NO_RETURN void __PROGRAM_START(void);

/*---------------------------------------------------------------------------
  Internal References
 *---------------------------------------------------------------------------*/
__NO_RETURN void Reset_Handler(void);
__NO_RETURN void Default_Handler(void);

/* ToDo: Add Cortex exception handler according the used Cortex-Core */
/*---------------------------------------------------------------------------
  Exception / Interrupt Handler
 *---------------------------------------------------------------------------*/
/* Exceptions */
void NMI_Handler(void) __attribute__((weak, alias("Default_Handler")));
void HardFault_Handler(void) __attribute__((weak));
void MemManage_Handler (void) __attribute__ ((weak, alias("Default_Handler")));
void BusFault_Handler (void) __attribute__ ((weak, alias("Default_Handler")));
void UsageFault_Handler (void) __attribute__ ((weak, alias("Default_Handler")));
void SecureFault_Handler (void) __attribute__ ((weak, alias("Default_Handler")));
void SVC_Handler (void) __attribute__((weak, alias("Default_Handler")));
void DebugMon_Handler (void) __attribute__ ((weak, alias("Default_Handler")));
void PendSV_Handler (void) __attribute__((weak, alias("Default_Handler")));
void SysTick_Handler (void) __attribute__((weak, alias("Default_Handler")));

/* Add your device specific interrupt handler */
/*---------------------------------------------------------------------------
  ISR
 *---------------------------------------------------------------------------*/
void WWDG_IRQHandler                (void) __attribute__((weak, alias("Default_Handler"))); /*  16 Window WatchDog interrupt ( wwdg1_it) */
void PVD_AVD_IRQHandler             (void) __attribute__((weak, alias("Default_Handler"))); /*  17 PVD/AVD through EXTI Line detection */
void TAMP_STAMP_IRQHandler          (void) __attribute__((weak, alias("Default_Handler"))); /*  18 Tamper and TimeStamps through the EXTI line */
void RTC_WKUP_IRQHandler            (void) __attribute__((weak, alias("Default_Handler"))); /*  19 RTC Wakeup through the EXTI line */
void FLASH_IRQHandler               (void) __attribute__((weak, alias("Default_Handler"))); /*  20 FLASH */
void RCC_IRQHandler                 (void) __attribute__((weak, alias("Default_Handler"))); /*  21 RCC */
void EXTI0_IRQHandler               (void) __attribute__((weak, alias("Default_Handler"))); /*  22 EXTI Line0 */
void EXTI1_IRQHandler               (void) __attribute__((weak, alias("Default_Handler"))); /*  23 EXTI Line1 */
void EXTI2_IRQHandler               (void) __attribute__((weak, alias("Default_Handler"))); /*    EXTI Line2 */
void EXTI3_IRQHandler               (void) __attribute__((weak, alias("Default_Handler"))); /*    EXTI Line3 */
void EXTI4_IRQHandler               (void) __attribute__((weak, alias("Default_Handler"))); /*    EXTI Line4 */
void DMA1_Stream0_IRQHandler        (void) __attribute__((weak, alias("Default_Handler"))); /*    DMA1 Stream 0 */
void DMA1_Stream1_IRQHandler        (void) __attribute__((weak, alias("Default_Handler"))); /*    DMA1 Stream 1 */
void DMA1_Stream2_IRQHandler        (void) __attribute__((weak, alias("Default_Handler"))); /*    DMA1 Stream 2 */
void DMA1_Stream3_IRQHandler        (void) __attribute__((weak, alias("Default_Handler"))); /*    DMA1 Stream 3 */
void DMA1_Stream4_IRQHandler        (void) __attribute__((weak, alias("Default_Handler"))); /*    DMA1 Stream 4 */
void DMA1_Stream5_IRQHandler        (void) __attribute__((weak, alias("Default_Handler"))); /*    DMA1 Stream 5 */
void DMA1_Stream6_IRQHandler        (void) __attribute__((weak, alias("Default_Handler"))); /*    DMA1 Stream 6 */
void ADC_IRQHandler                 (void) __attribute__((weak, alias("Default_Handler"))); /*    ADC1, ADC2 */
void FDCAN1_IT0_IRQHandler          (void) __attribute__((weak, alias("Default_Handler"))); /*    FDCAN1 interrupt line 0 */
void FDCAN2_IT0_IRQHandler          (void) __attribute__((weak, alias("Default_Handler"))); /*    FDCAN2 interrupt line 0 */
void FDCAN1_IT1_IRQHandler          (void) __attribute__((weak, alias("Default_Handler"))); /*    FDCAN1 interrupt line 1 */
void FDCAN2_IT1_IRQHandler          (void) __attribute__((weak, alias("Default_Handler"))); /*    FDCAN2 interrupt line 1 */
void EXTI9_5_IRQHandler             (void) __attribute__((weak, alias("Default_Handler"))); /*    External Line[9:5]s */
void TIM1_BRK_IRQHandler            (void) __attribute__((weak, alias("Default_Handler"))); /*    TIM1 Break interrupt */
void TIM1_UP_IRQHandler             (void) __attribute__((weak, alias("Default_Handler"))); /*    TIM1 Update Interrupt */
void TIM1_TRG_COM_IRQHandler        (void) __attribute__((weak, alias("Default_Handler"))); /*    TIM1 Trigger and Commutation Interrupt */
void TIM1_CC_IRQHandler             (void) __attribute__((weak, alias("Default_Handler"))); /*    TIM1 Capture Compare */
void TIM2_IRQHandler                (void) __attribute__((weak, alias("Default_Handler"))); /*    TIM2 */
void TIM3_IRQHandler                (void) __attribute__((weak, alias("Default_Handler"))); /*    TIM3 */
void TIM4_IRQHandler                (void) __attribute__((weak, alias("Default_Handler"))); /*    TIM4 */
void I2C1_EV_IRQHandler             (void) __attribute__((weak, alias("Default_Handler"))); /*    I2C1 Event */
void I2C1_ER_IRQHandler             (void) __attribute__((weak, alias("Default_Handler"))); /*    I2C1 Error */
void I2C2_EV_IRQHandler             (void) __attribute__((weak, alias("Default_Handler"))); /*    I2C2 Event */
void I2C2_ER_IRQHandler             (void) __attribute__((weak, alias("Default_Handler"))); /*    I2C2 Error */
void SPI1_IRQHandler                (void) __attribute__((weak, alias("Default_Handler"))); /*    SPI1 */
void SPI2_IRQHandler                (void) __attribute__((weak, alias("Default_Handler"))); /*    SPI2 */
void USART1_IRQHandler              (void) __attribute__((weak, alias("Default_Handler"))); /*    USART1 */
void USART2_IRQHandler              (void) __attribute__((weak, alias("Default_Handler"))); /*    USART2 */
void USART3_IRQHandler              (void) __attribute__((weak, alias("Default_Handler"))); /*    USART3 */
void EXTI15_10_IRQHandler           (void) __attribute__((weak, alias("Default_Handler"))); /*    External Line[15:10] */
void RTC_Alarm_IRQHandler           (void) __attribute__((weak, alias("Default_Handler"))); /*    RTC Alarm (A and B) through EXTI Line */
//void 0                            (void)   __attribute__((weak, alias("Default_Handler"))); /*    Reserved */
void TIM8_BRK_TIM12_IRQHandler      (void) __attribute__((weak, alias("Default_Handler"))); /*    TIM8 Break Interrupt and TIM12 global interrupt */
void TIM8_UP_TIM13_IRQHandler       (void) __attribute__((weak, alias("Default_Handler"))); /*    TIM8 Update Interrupt and TIM13 global interrupt */
void TIM8_TRG_COM_TIM14_IRQHandler  (void) __attribute__((weak, alias("Default_Handler"))); /*    TIM8 Trigger and Commutation Interrupt and TIM14 global interrupt */
void TIM8_CC_IRQHandler             (void) __attribute__((weak, alias("Default_Handler"))); /*    TIM8 Capture Compare Interrupt */
void DMA1_Stream7_IRQHandler        (void) __attribute__((weak, alias("Default_Handler"))); /*    DMA1 Stream7 */
void FMC_IRQHandler                 (void) __attribute__((weak, alias("Default_Handler"))); /*    FMC */
void SDMMC1_IRQHandler              (void) __attribute__((weak, alias("Default_Handler"))); /*    SDMMC1 */
void TIM5_IRQHandler                (void) __attribute__((weak, alias("Default_Handler"))); /*    TIM5 */
void SPI3_IRQHandler                (void) __attribute__((weak, alias("Default_Handler"))); /*    SPI3 */
void UART4_IRQHandler               (void) __attribute__((weak, alias("Default_Handler"))); /*    UART4 */
void UART5_IRQHandler               (void) __attribute__((weak, alias("Default_Handler"))); /*    UART5 */
void TIM6_DAC_IRQHandler            (void) __attribute__((weak, alias("Default_Handler"))); /*    TIM6 and DAC1&2 underrun errors */
void TIM7_IRQHandler                (void) __attribute__((weak, alias("Default_Handler"))); /*    TIM7 */
void DMA2_Stream0_IRQHandler        (void) __attribute__((weak, alias("Default_Handler"))); /*    DMA2 Stream 0 */
void DMA2_Stream1_IRQHandler        (void) __attribute__((weak, alias("Default_Handler"))); /*    DMA2 Stream 1 */
void DMA2_Stream2_IRQHandler        (void) __attribute__((weak, alias("Default_Handler"))); /*    DMA2 Stream 2 */
void DMA2_Stream3_IRQHandler        (void) __attribute__((weak, alias("Default_Handler"))); /*    DMA2 Stream 3 */
void DMA2_Stream4_IRQHandler        (void) __attribute__((weak, alias("Default_Handler"))); /*    DMA2 Stream 4 */
void ETH_IRQHandler                 (void) __attribute__((weak, alias("Default_Handler"))); /*    Ethernet */
void ETH_WKUP_IRQHandler            (void) __attribute__((weak, alias("Default_Handler"))); /*    Ethernet Wakeup through EXTI line */
void FDCAN_CAL_IRQHandler           (void) __attribute__((weak, alias("Default_Handler"))); /*    FDCAN calibration unit interrupt */
//void 0                            (void)   __attribute__((weak, alias("Default_Handler"))); /*    Reserved */
//void 0                            (void)   __attribute__((weak, alias("Default_Handler"))); /*    Reserved */
//void 0                            (void)   __attribute__((weak, alias("Default_Handler"))); /*    Reserved */
//void 0                            (void)   __attribute__((weak, alias("Default_Handler"))); /*    Reserved */
void DMA2_Stream5_IRQHandler        (void) __attribute__((weak, alias("Default_Handler"))); /*    DMA2 Stream 5 */
void DMA2_Stream6_IRQHandler        (void) __attribute__((weak, alias("Default_Handler"))); /*    DMA2 Stream 6 */
void DMA2_Stream7_IRQHandler        (void) __attribute__((weak, alias("Default_Handler"))); /*    DMA2 Stream 7 */
void USART6_IRQHandler              (void) __attribute__((weak, alias("Default_Handler"))); /*    USART6 */
void I2C3_EV_IRQHandler             (void) __attribute__((weak, alias("Default_Handler"))); /*    I2C3 event */
void I2C3_ER_IRQHandler             (void) __attribute__((weak, alias("Default_Handler"))); /*    I2C3 error */
void OTG_HS_EP1_OUT_IRQHandler      (void) __attribute__((weak, alias("Default_Handler"))); /*    USB OTG HS End Point 1 Out */
void OTG_HS_EP1_IN_IRQHandler       (void) __attribute__((weak, alias("Default_Handler"))); /*    USB OTG HS End Point 1 In */
void OTG_HS_WKUP_IRQHandler         (void) __attribute__((weak, alias("Default_Handler"))); /*    USB OTG HS Wakeup through EXTI */
void OTG_HS_IRQHandler              (void) __attribute__((weak, alias("Default_Handler"))); /*    USB OTG HS */
void DCMI_IRQHandler                (void) __attribute__((weak, alias("Default_Handler"))); /*    DCMI */
//void 0                            (void)   __attribute__((weak, alias("Default_Handler"))); /*    Reserved */
void RNG_IRQHandler                 (void) __attribute__((weak, alias("Default_Handler"))); /*    Rng */
void FPU_IRQHandler                 (void) __attribute__((weak, alias("Default_Handler"))); /*    FPU */
void UART7_IRQHandler               (void) __attribute__((weak, alias("Default_Handler"))); /*    UART7 */
void UART8_IRQHandler               (void) __attribute__((weak, alias("Default_Handler"))); /*    UART8 */
void SPI4_IRQHandler                (void) __attribute__((weak, alias("Default_Handler"))); /*    SPI4 */
void SPI5_IRQHandler                (void) __attribute__((weak, alias("Default_Handler"))); /*    SPI5 */
void SPI6_IRQHandler                (void) __attribute__((weak, alias("Default_Handler"))); /*    SPI6 */
void SAI1_IRQHandler                (void) __attribute__((weak, alias("Default_Handler"))); /*    SAI1 */
void LTDC_IRQHandler                (void) __attribute__((weak, alias("Default_Handler"))); /*    LTDC */
void LTDC_ER_IRQHandler             (void) __attribute__((weak, alias("Default_Handler"))); /*    LTDC error */
void DMA2D_IRQHandler               (void) __attribute__((weak, alias("Default_Handler"))); /*    DMA2D */
void SAI2_IRQHandler                (void) __attribute__((weak, alias("Default_Handler"))); /*    SAI2 */
void QUADSPI_IRQHandler             (void) __attribute__((weak, alias("Default_Handler"))); /*    QUADSPI */
void LPTIM1_IRQHandler              (void) __attribute__((weak, alias("Default_Handler"))); /*    LPTIM1 */
void CEC_IRQHandler                 (void) __attribute__((weak, alias("Default_Handler"))); /*    HDMI_CEC */
void I2C4_EV_IRQHandler             (void) __attribute__((weak, alias("Default_Handler"))); /*    I2C4 Event */
void I2C4_ER_IRQHandler             (void) __attribute__((weak, alias("Default_Handler"))); /*    I2C4 Error */
void SPDIF_RX_IRQHandler            (void) __attribute__((weak, alias("Default_Handler"))); /*    SPDIF_RX */
void OTG_FS_EP1_OUT_IRQHandler      (void) __attribute__((weak, alias("Default_Handler"))); /*    USB OTG FS End Point 1 Out */
void OTG_FS_EP1_IN_IRQHandler       (void) __attribute__((weak, alias("Default_Handler"))); /*    USB OTG FS End Point 1 In */
void OTG_FS_WKUP_IRQHandler         (void) __attribute__((weak, alias("Default_Handler"))); /*    USB OTG FS Wakeup through EXTI */
void OTG_FS_IRQHandler              (void) __attribute__((weak, alias("Default_Handler"))); /*    USB OTG FS */
void DMAMUX1_OVR_IRQHandler         (void) __attribute__((weak, alias("Default_Handler"))); /*    DMAMUX1 Overrun interrupt */
void HRTIM1_Master_IRQHandler       (void) __attribute__((weak, alias("Default_Handler"))); /*    HRTIM Master Timer global Interrupts */
void HRTIM1_TIMA_IRQHandler         (void) __attribute__((weak, alias("Default_Handler"))); /*    HRTIM Timer A global Interrupt */
void HRTIM1_TIMB_IRQHandler         (void) __attribute__((weak, alias("Default_Handler"))); /*    HRTIM Timer B global Interrupt */
void HRTIM1_TIMC_IRQHandler         (void) __attribute__((weak, alias("Default_Handler"))); /*    HRTIM Timer C global Interrupt */
void HRTIM1_TIMD_IRQHandler         (void) __attribute__((weak, alias("Default_Handler"))); /*    HRTIM Timer D global Interrupt */
void HRTIM1_TIME_IRQHandler         (void) __attribute__((weak, alias("Default_Handler"))); /*    HRTIM Timer E global Interrupt */
void HRTIM1_FLT_IRQHandler          (void) __attribute__((weak, alias("Default_Handler"))); /*    HRTIM Fault global Interrupt */
void DFSDM1_FLT0_IRQHandler         (void) __attribute__((weak, alias("Default_Handler"))); /*    DFSDM Filter0 Interrupt */
void DFSDM1_FLT1_IRQHandler         (void) __attribute__((weak, alias("Default_Handler"))); /*    DFSDM Filter1 Interrupt */
void DFSDM1_FLT2_IRQHandler         (void) __attribute__((weak, alias("Default_Handler"))); /*    DFSDM Filter2 Interrupt */
void DFSDM1_FLT3_IRQHandler         (void) __attribute__((weak, alias("Default_Handler"))); /*    DFSDM Filter3 Interrupt */
void SAI3_IRQHandler                (void) __attribute__((weak, alias("Default_Handler"))); /*    SAI3 global Interrupt */
void SWPMI1_IRQHandler              (void) __attribute__((weak, alias("Default_Handler"))); /*    Serial Wire Interface 1 global interrupt */
void TIM15_IRQHandler               (void) __attribute__((weak, alias("Default_Handler"))); /*    TIM15 global Interrupt */
void TIM16_IRQHandler               (void) __attribute__((weak, alias("Default_Handler"))); /*    TIM16 global Interrupt */
void TIM17_IRQHandler               (void) __attribute__((weak, alias("Default_Handler"))); /*    TIM17 global Interrupt */
void MDIOS_WKUP_IRQHandler          (void) __attribute__((weak, alias("Default_Handler"))); /*    MDIOS Wakeup  Interrupt */
void MDIOS_IRQHandler               (void) __attribute__((weak, alias("Default_Handler"))); /*    MDIOS global Interrupt */
void JPEG_IRQHandler                (void) __attribute__((weak, alias("Default_Handler"))); /*    JPEG global Interrupt */
void MDMA_IRQHandler                (void) __attribute__((weak, alias("Default_Handler"))); /*    MDMA global Interrupt */
//void 0                            (void)   __attribute__((weak, alias("Default_Handler"))); /*    Reserved */
void SDMMC2_IRQHandler              (void) __attribute__((weak, alias("Default_Handler"))); /*    SDMMC2 global Interrupt */
void HSEM1_IRQHandler               (void) __attribute__((weak, alias("Default_Handler"))); /*    HSEM1 global Interrupt */
//void 0                            (void)   __attribute__((weak, alias("Default_Handler"))); /*    Reserved */
void ADC3_IRQHandler                (void) __attribute__((weak, alias("Default_Handler"))); /*    ADC3 global Interrupt */
void DMAMUX2_OVR_IRQHandler         (void) __attribute__((weak, alias("Default_Handler"))); /*    DMAMUX Overrun interrupt */
void BDMA_Channel0_IRQHandler       (void) __attribute__((weak, alias("Default_Handler"))); /*    BDMA Channel 0 global Interrupt */
void BDMA_Channel1_IRQHandler       (void) __attribute__((weak, alias("Default_Handler"))); /*    BDMA Channel 1 global Interrupt */
void BDMA_Channel2_IRQHandler       (void) __attribute__((weak, alias("Default_Handler"))); /*    BDMA Channel 2 global Interrupt */
void BDMA_Channel3_IRQHandler       (void) __attribute__((weak, alias("Default_Handler"))); /*    BDMA Channel 3 global Interrupt */
void BDMA_Channel4_IRQHandler       (void) __attribute__((weak, alias("Default_Handler"))); /*    BDMA Channel 4 global Interrupt */
void BDMA_Channel5_IRQHandler       (void) __attribute__((weak, alias("Default_Handler"))); /*    BDMA Channel 5 global Interrupt */
void BDMA_Channel6_IRQHandler       (void) __attribute__((weak, alias("Default_Handler"))); /*    BDMA Channel 6 global Interrupt */
void BDMA_Channel7_IRQHandler       (void) __attribute__((weak, alias("Default_Handler"))); /*    BDMA Channel 7 global Interrupt */
void COMP1_IRQHandler               (void) __attribute__((weak, alias("Default_Handler"))); /*    COMP1 global Interrupt */
void LPTIM2_IRQHandler              (void) __attribute__((weak, alias("Default_Handler"))); /*    LP TIM2 global interrupt */
void LPTIM3_IRQHandler              (void) __attribute__((weak, alias("Default_Handler"))); /*    LP TIM3 global interrupt */
void LPTIM4_IRQHandler              (void) __attribute__((weak, alias("Default_Handler"))); /*    LP TIM4 global interrupt */
void LPTIM5_IRQHandler              (void) __attribute__((weak, alias("Default_Handler"))); /*    LP TIM5 global interrupt */
void LPUART1_IRQHandler             (void) __attribute__((weak, alias("Default_Handler"))); /*    LP UART1 interrupt */
//void 0                            (void)   __attribute__((weak, alias("Default_Handler"))); /*    Reserved */
void CRS_IRQHandler                 (void) __attribute__((weak, alias("Default_Handler"))); /*    Clock Recovery Global Interrupt */
void ECC_IRQHandler                 (void) __attribute__((weak, alias("Default_Handler"))); /*    ECC diagnostic Global Interrupt */
void SAI4_IRQHandler                (void) __attribute__((weak, alias("Default_Handler"))); /*    SAI4 global interrupt */
//void 0                            (void)   __attribute__((weak, alias("Default_Handler"))); /*    Reserved */
//void 0                            (void)   __attribute__((weak, alias("Default_Handler"))); /*    Reserved */
void WAKEUP_PIN_IRQHandler          (void) __attribute__((weak, alias("Default_Handler"))); /*    Interrupt for all 6 wake-up pins */
/*-----------------------------------------------------------------------------
  Exception / Interrupt Vector table
 *----------------------------------------------------------------------------*/

#if defined(__GNUC__)
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wpedantic"
#endif

