kodezine/STM32H743I-EVAL2/demo/__startup/__vectors.c
/* ToDo: Add Cortex exception vectors according the used Cortex-Core */
extern const VECTOR_TABLE_Type __VECTOR_TABLE[];
const VECTOR_TABLE_Type __VECTOR_TABLE[] __VECTOR_TABLE_ATTRIBUTE = {
    (VECTOR_TABLE_Type)(&__INITIAL_SP)                 ,/*     Initial Stack Pointer */
    (VECTOR_TABLE_Type)&Reset_Handler                  ,/*     Reset Handler */
    (VECTOR_TABLE_Type)&NMI_Handler                    ,/* -14 NMI Handler */
    (VECTOR_TABLE_Type)&HardFault_Handler              ,/* -13 Hard Fault Handler */
    (VECTOR_TABLE_Type)&MemManage_Handler              ,/* -12 MPU Fault Handler */
    (VECTOR_TABLE_Type)&BusFault_Handler               ,/* -11 Bus Fault Handler */
    (VECTOR_TABLE_Type)&UsageFault_Handler             ,/* -10 Usage Fault Handler */
    (VECTOR_TABLE_Type)0                               ,/*  -9 Reserved */
    (VECTOR_TABLE_Type)0                               ,/*  -8 Reserved */
    (VECTOR_TABLE_Type)0                               ,/*  -7 Reserved */
    (VECTOR_TABLE_Type)0                               ,/*  -6 Reserved */
    (VECTOR_TABLE_Type)&SVC_Handler                    ,/*  -5 SVCall Handler */
    (VECTOR_TABLE_Type)&DebugMon_Handler               ,/*  -4 Debug Monitor Handler */
    (VECTOR_TABLE_Type)0                               ,/*  -3 Reserved */
    (VECTOR_TABLE_Type)&PendSV_Handler                 ,/*  -2 PendSV Handler */
    (VECTOR_TABLE_Type)&SysTick_Handler                ,/*  -1 SysTick Handler */


    (VECTOR_TABLE_Type)&WWDG_IRQHandler                ,/*  16 Window WatchDog interrupt ( wwdg1_it) */
    (VECTOR_TABLE_Type)&PVD_AVD_IRQHandler             ,/*  17 PVD/AVD through EXTI Line detection */
    (VECTOR_TABLE_Type)&TAMP_STAMP_IRQHandler          ,/*  18 Tamper and TimeStamps through the EXTI line */
    (VECTOR_TABLE_Type)&RTC_WKUP_IRQHandler            ,/*  19 RTC Wakeup through the EXTI line */
    (VECTOR_TABLE_Type)&FLASH_IRQHandler               ,/*  20 FLASH */
    (VECTOR_TABLE_Type)&RCC_IRQHandler                 ,/*  21 RCC */
    (VECTOR_TABLE_Type)&EXTI0_IRQHandler               ,/*  22 EXTI Line0 */
    (VECTOR_TABLE_Type)&EXTI1_IRQHandler               ,/*  23 EXTI Line1 */
    (VECTOR_TABLE_Type)&EXTI2_IRQHandler               ,/*    EXTI Line2 */
    (VECTOR_TABLE_Type)&EXTI3_IRQHandler               ,/*    EXTI Line3 */
    (VECTOR_TABLE_Type)&EXTI4_IRQHandler               ,/*    EXTI Line4 */
    (VECTOR_TABLE_Type)&DMA1_Stream0_IRQHandler        ,/*    DMA1 Stream 0 */
    (VECTOR_TABLE_Type)&DMA1_Stream1_IRQHandler        ,/*    DMA1 Stream 1 */
    (VECTOR_TABLE_Type)&DMA1_Stream2_IRQHandler        ,/*    DMA1 Stream 2 */
    (VECTOR_TABLE_Type)&DMA1_Stream3_IRQHandler        ,/*    DMA1 Stream 3 */
    (VECTOR_TABLE_Type)&DMA1_Stream4_IRQHandler        ,/*    DMA1 Stream 4 */
    (VECTOR_TABLE_Type)&DMA1_Stream5_IRQHandler        ,/*    DMA1 Stream 5 */
    (VECTOR_TABLE_Type)&DMA1_Stream6_IRQHandler        ,/*    DMA1 Stream 6 */
    (VECTOR_TABLE_Type)&ADC_IRQHandler                 ,/*    ADC1, ADC2 */
    (VECTOR_TABLE_Type)&FDCAN1_IT0_IRQHandler          ,/*    FDCAN1 interrupt line 0 */
    (VECTOR_TABLE_Type)&FDCAN2_IT0_IRQHandler          ,/*    FDCAN2 interrupt line 0 */
    (VECTOR_TABLE_Type)&FDCAN1_IT1_IRQHandler          ,/*    FDCAN1 interrupt line 1 */
    (VECTOR_TABLE_Type)&FDCAN2_IT1_IRQHandler          ,/*    FDCAN2 interrupt line 1 */
    (VECTOR_TABLE_Type)&EXTI9_5_IRQHandler             ,/*    External Line[9:5]s */
    (VECTOR_TABLE_Type)&TIM1_BRK_IRQHandler            ,/*    TIM1 Break interrupt */
    (VECTOR_TABLE_Type)&TIM1_UP_IRQHandler             ,/*    TIM1 Update Interrupt */
    (VECTOR_TABLE_Type)&TIM1_TRG_COM_IRQHandler        ,/*    TIM1 Trigger and Commutation Interrupt */
    (VECTOR_TABLE_Type)&TIM1_CC_IRQHandler             ,/*    TIM1 Capture Compare */
    (VECTOR_TABLE_Type)&TIM2_IRQHandler                ,/*    TIM2 */
    (VECTOR_TABLE_Type)&TIM3_IRQHandler                ,/*    TIM3 */
    (VECTOR_TABLE_Type)&TIM4_IRQHandler                ,/*    TIM4 */
    (VECTOR_TABLE_Type)&I2C1_EV_IRQHandler             ,/*    I2C1 Event */
    (VECTOR_TABLE_Type)&I2C1_ER_IRQHandler             ,/*    I2C1 Error */
    (VECTOR_TABLE_Type)&I2C2_EV_IRQHandler             ,/*    I2C2 Event */
    (VECTOR_TABLE_Type)&I2C2_ER_IRQHandler             ,/*    I2C2 Error */
    (VECTOR_TABLE_Type)&SPI1_IRQHandler                ,/*    SPI1 */
    (VECTOR_TABLE_Type)&SPI2_IRQHandler                ,/*    SPI2 */
    (VECTOR_TABLE_Type)&USART1_IRQHandler              ,/*    USART1 */
    (VECTOR_TABLE_Type)&USART2_IRQHandler              ,/*    USART2 */
    (VECTOR_TABLE_Type)&USART3_IRQHandler              ,/*    USART3 */
    (VECTOR_TABLE_Type)&EXTI15_10_IRQHandler           ,/*    External Line[15:10] */
    (VECTOR_TABLE_Type)&RTC_Alarm_IRQHandler           ,/*    RTC Alarm (A and B) through EXTI Line */
    (VECTOR_TABLE_Type)0                               ,/*    Reserved */
    (VECTOR_TABLE_Type)&TIM8_BRK_TIM12_IRQHandler      ,/*    TIM8 Break Interrupt and TIM12 global interrupt */
    (VECTOR_TABLE_Type)&TIM8_UP_TIM13_IRQHandler       ,/*    TIM8 Update Interrupt and TIM13 global interrupt */
    (VECTOR_TABLE_Type)&TIM8_TRG_COM_TIM14_IRQHandler  ,/*    TIM8 Trigger and Commutation Interrupt and TIM14 global interrupt */
    (VECTOR_TABLE_Type)&TIM8_CC_IRQHandler             ,/*    TIM8 Capture Compare Interrupt */
    (VECTOR_TABLE_Type)&DMA1_Stream7_IRQHandler        ,/*    DMA1 Stream7 */
    (VECTOR_TABLE_Type)&FMC_IRQHandler                 ,/*    FMC */
    (VECTOR_TABLE_Type)&SDMMC1_IRQHandler              ,/*    SDMMC1 */
    (VECTOR_TABLE_Type)&TIM5_IRQHandler                ,/*    TIM5 */
    (VECTOR_TABLE_Type)&SPI3_IRQHandler                ,/*    SPI3 */
    (VECTOR_TABLE_Type)&UART4_IRQHandler               ,/*    UART4 */
    (VECTOR_TABLE_Type)&UART5_IRQHandler               ,/*    UART5 */
    (VECTOR_TABLE_Type)&TIM6_DAC_IRQHandler            ,/*    TIM6 and DAC1&2 underrun errors */
    (VECTOR_TABLE_Type)&TIM7_IRQHandler                ,/*    TIM7 */
    (VECTOR_TABLE_Type)&DMA2_Stream0_IRQHandler        ,/*    DMA2 Stream 0 */
    (VECTOR_TABLE_Type)&DMA2_Stream1_IRQHandler        ,/*    DMA2 Stream 1 */
    (VECTOR_TABLE_Type)&DMA2_Stream2_IRQHandler        ,/*    DMA2 Stream 2 */
    (VECTOR_TABLE_Type)&DMA2_Stream3_IRQHandler        ,/*    DMA2 Stream 3 */
    (VECTOR_TABLE_Type)&DMA2_Stream4_IRQHandler        ,/*    DMA2 Stream 4 */
    (VECTOR_TABLE_Type)&ETH_IRQHandler                 ,/*    Ethernet */
    (VECTOR_TABLE_Type)&ETH_WKUP_IRQHandler            ,/*    Ethernet Wakeup through EXTI line */
    (VECTOR_TABLE_Type)&FDCAN_CAL_IRQHandler           ,/*    FDCAN calibration unit interrupt */
    (VECTOR_TABLE_Type)0                               ,/*    Reserved */
    (VECTOR_TABLE_Type)0                               ,/*    Reserved */
    (VECTOR_TABLE_Type)0                               ,/*    Reserved */
    (VECTOR_TABLE_Type)0                               ,/*    Reserved */
    (VECTOR_TABLE_Type)&DMA2_Stream5_IRQHandler        ,/*    DMA2 Stream 5 */
    (VECTOR_TABLE_Type)&DMA2_Stream6_IRQHandler        ,/*    DMA2 Stream 6 */
    (VECTOR_TABLE_Type)&DMA2_Stream7_IRQHandler        ,/*    DMA2 Stream 7 */
    (VECTOR_TABLE_Type)&USART6_IRQHandler              ,/*    USART6 */
    (VECTOR_TABLE_Type)&I2C3_EV_IRQHandler             ,/*    I2C3 event */
    (VECTOR_TABLE_Type)&I2C3_ER_IRQHandler             ,/*    I2C3 error */
    (VECTOR_TABLE_Type)&OTG_HS_EP1_OUT_IRQHandler      ,/*    USB OTG HS End Point 1 Out */
    (VECTOR_TABLE_Type)&OTG_HS_EP1_IN_IRQHandler       ,/*    USB OTG HS End Point 1 In */
    (VECTOR_TABLE_Type)&OTG_HS_WKUP_IRQHandler         ,/*    USB OTG HS Wakeup through EXTI */
    (VECTOR_TABLE_Type)&OTG_HS_IRQHandler              ,/*    USB OTG HS */
    (VECTOR_TABLE_Type)&DCMI_IRQHandler                ,/*    DCMI */
    (VECTOR_TABLE_Type)0                               ,/*    Reserved */
    (VECTOR_TABLE_Type)&RNG_IRQHandler                 ,/*    Rng */
    (VECTOR_TABLE_Type)&FPU_IRQHandler                 ,/*    FPU */
    (VECTOR_TABLE_Type)&UART7_IRQHandler               ,/*    UART7 */
    (VECTOR_TABLE_Type)&UART8_IRQHandler               ,/*    UART8 */
    (VECTOR_TABLE_Type)&SPI4_IRQHandler                ,/*    SPI4 */
    (VECTOR_TABLE_Type)&SPI5_IRQHandler                ,/*    SPI5 */
    (VECTOR_TABLE_Type)&SPI6_IRQHandler                ,/*    SPI6 */
    (VECTOR_TABLE_Type)&SAI1_IRQHandler                ,/*    SAI1 */
    (VECTOR_TABLE_Type)&LTDC_IRQHandler                ,/*    LTDC */
    (VECTOR_TABLE_Type)&LTDC_ER_IRQHandler             ,/*    LTDC error */
    (VECTOR_TABLE_Type)&DMA2D_IRQHandler               ,/*    DMA2D */
    (VECTOR_TABLE_Type)&SAI2_IRQHandler                ,/*    SAI2 */
    (VECTOR_TABLE_Type)&QUADSPI_IRQHandler             ,/*    QUADSPI */
    (VECTOR_TABLE_Type)&LPTIM1_IRQHandler              ,/*    LPTIM1 */
    (VECTOR_TABLE_Type)&CEC_IRQHandler                 ,/*    HDMI_CEC */
    (VECTOR_TABLE_Type)&I2C4_EV_IRQHandler             ,/*    I2C4 Event */
    (VECTOR_TABLE_Type)&I2C4_ER_IRQHandler             ,/*    I2C4 Error */
    (VECTOR_TABLE_Type)&SPDIF_RX_IRQHandler            ,/*    SPDIF_RX */
    (VECTOR_TABLE_Type)&OTG_FS_EP1_OUT_IRQHandler      ,/*    USB OTG FS End Point 1 Out */
    (VECTOR_TABLE_Type)&OTG_FS_EP1_IN_IRQHandler       ,/*    USB OTG FS End Point 1 In */
    (VECTOR_TABLE_Type)&OTG_FS_WKUP_IRQHandler         ,/*    USB OTG FS Wakeup through EXTI */
    (VECTOR_TABLE_Type)&OTG_FS_IRQHandler              ,/*    USB OTG FS */
    (VECTOR_TABLE_Type)&DMAMUX1_OVR_IRQHandler         ,/*    DMAMUX1 Overrun interrupt */
    (VECTOR_TABLE_Type)&HRTIM1_Master_IRQHandler       ,/*    HRTIM Master Timer global Interrupts */
    (VECTOR_TABLE_Type)&HRTIM1_TIMA_IRQHandler         ,/*    HRTIM Timer A global Interrupt */
    (VECTOR_TABLE_Type)&HRTIM1_TIMB_IRQHandler         ,/*    HRTIM Timer B global Interrupt */
    (VECTOR_TABLE_Type)&HRTIM1_TIMC_IRQHandler         ,/*    HRTIM Timer C global Interrupt */
    (VECTOR_TABLE_Type)&HRTIM1_TIMD_IRQHandler         ,/*    HRTIM Timer D global Interrupt */
    (VECTOR_TABLE_Type)&HRTIM1_TIME_IRQHandler         ,/*    HRTIM Timer E global Interrupt */
    (VECTOR_TABLE_Type)&HRTIM1_FLT_IRQHandler          ,/*    HRTIM Fault global Interrupt */
    (VECTOR_TABLE_Type)&DFSDM1_FLT0_IRQHandler         ,/*    DFSDM Filter0 Interrupt */
    (VECTOR_TABLE_Type)&DFSDM1_FLT1_IRQHandler         ,/*    DFSDM Filter1 Interrupt */
    (VECTOR_TABLE_Type)&DFSDM1_FLT2_IRQHandler         ,/*    DFSDM Filter2 Interrupt */
    (VECTOR_TABLE_Type)&DFSDM1_FLT3_IRQHandler         ,/*    DFSDM Filter3 Interrupt */
    (VECTOR_TABLE_Type)&SAI3_IRQHandler                ,/*    SAI3 global Interrupt */
    (VECTOR_TABLE_Type)&SWPMI1_IRQHandler              ,/*    Serial Wire Interface 1 global interrupt */
    (VECTOR_TABLE_Type)&TIM15_IRQHandler               ,/*    TIM15 global Interrupt */
    (VECTOR_TABLE_Type)&TIM16_IRQHandler               ,/*    TIM16 global Interrupt */
    (VECTOR_TABLE_Type)&TIM17_IRQHandler               ,/*    TIM17 global Interrupt */
    (VECTOR_TABLE_Type)&MDIOS_WKUP_IRQHandler          ,/*    MDIOS Wakeup  Interrupt */
    (VECTOR_TABLE_Type)&MDIOS_IRQHandler               ,/*    MDIOS global Interrupt */
    (VECTOR_TABLE_Type)&JPEG_IRQHandler                ,/*    JPEG global Interrupt */
    (VECTOR_TABLE_Type)&MDMA_IRQHandler                ,/*    MDMA global Interrupt */
    (VECTOR_TABLE_Type)0                               ,/*    Reserved */
    (VECTOR_TABLE_Type)&SDMMC2_IRQHandler              ,/*    SDMMC2 global Interrupt */
    (VECTOR_TABLE_Type)&HSEM1_IRQHandler               ,/*    HSEM1 global Interrupt */
    (VECTOR_TABLE_Type)0                               ,/*    Reserved */
    (VECTOR_TABLE_Type)&ADC3_IRQHandler                ,/*    ADC3 global Interrupt */
    (VECTOR_TABLE_Type)&DMAMUX2_OVR_IRQHandler         ,/*    DMAMUX Overrun interrupt */
    (VECTOR_TABLE_Type)&BDMA_Channel0_IRQHandler       ,/*    BDMA Channel 0 global Interrupt */
    (VECTOR_TABLE_Type)&BDMA_Channel1_IRQHandler       ,/*    BDMA Channel 1 global Interrupt */
    (VECTOR_TABLE_Type)&BDMA_Channel2_IRQHandler       ,/*    BDMA Channel 2 global Interrupt */
    (VECTOR_TABLE_Type)&BDMA_Channel3_IRQHandler       ,/*    BDMA Channel 3 global Interrupt */
    (VECTOR_TABLE_Type)&BDMA_Channel4_IRQHandler       ,/*    BDMA Channel 4 global Interrupt */
    (VECTOR_TABLE_Type)&BDMA_Channel5_IRQHandler       ,/*    BDMA Channel 5 global Interrupt */
    (VECTOR_TABLE_Type)&BDMA_Channel6_IRQHandler       ,/*    BDMA Channel 6 global Interrupt */
    (VECTOR_TABLE_Type)&BDMA_Channel7_IRQHandler       ,/*    BDMA Channel 7 global Interrupt */
    (VECTOR_TABLE_Type)&COMP1_IRQHandler               ,/*    COMP1 global Interrupt */
    (VECTOR_TABLE_Type)&LPTIM2_IRQHandler              ,/*    LP TIM2 global interrupt */
    (VECTOR_TABLE_Type)&LPTIM3_IRQHandler              ,/*    LP TIM3 global interrupt */
    (VECTOR_TABLE_Type)&LPTIM4_IRQHandler              ,/*    LP TIM4 global interrupt */
    (VECTOR_TABLE_Type)&LPTIM5_IRQHandler              ,/*    LP TIM5 global interrupt */
    (VECTOR_TABLE_Type)&LPUART1_IRQHandler             ,/*    LP UART1 interrupt */
    (VECTOR_TABLE_Type)0                               ,/*    Reserved */
    (VECTOR_TABLE_Type)&CRS_IRQHandler                 ,/*    Clock Recovery Global Interrupt */
    (VECTOR_TABLE_Type)&ECC_IRQHandler                 ,/*    ECC diagnostic Global Interrupt */
    (VECTOR_TABLE_Type)&SAI4_IRQHandler                ,/*    SAI4 global interrupt */
    (VECTOR_TABLE_Type)0                               ,/*    Reserved */
    (VECTOR_TABLE_Type)0                               ,/*    Reserved */
    (VECTOR_TABLE_Type)&WAKEUP_PIN_IRQHandler          ,/*    Interrupt for all 6 wake-up pins */

